(function(window, undefind) {
  // 21---94 定义了一些变量和函数   jQuery = function () {}
  // 96---283 给jquery对象添加方法和属性
  // 285---347 extend jquery继承的方法 $().css 实例方法
  // 349---817 jQuery.extend() 扩展工具方法 $.proxy() 静态方法
  // 877---2845 完成复杂选择器实现 [1094] Sizzle函数
  // 2880---3042 jquery的回调对象：函数统一管理
  // 3043--- 3183 延迟对象：对异步统一管理
  // 3184---3295 功能检测，检测浏览器是否支持某功能
  // 3308---3653 data() 方法的功能 数据缓存
  // 3654---3798 queue() 队列管理
  // 3804---4300 对元素属性操作 arrt()....
  // 4301---5129 on()  事件操作方法
  // 5141---6058 DOM操作 添加、删除。。。。
  // 6059---6621 样式操作 css()
  // 8829  window.jQuery = window.$ = jQuery;
})(window);
